info_prepods = [
    (1, 'Соколян А. А.', '1-2-1984', 'Преподаватель', False, 'Средняя', 20000),
    (2, 'Дедова В. В.', '30-3-1999', 'Преподаватель', True, 'Низкая', 13000),
    (3, 'Рыбалка С. С.', '1-12-2020', 'Преподаватель', False, 'Высокая', 30000),
    (4, 'Асташевская Т. О.', '24-6-2001', 'Преподаватель', False, 'Средняя', 22000),
    (5, 'Бойнар И. Г.', '15-9-1965', 'Преподаватель', False, 'Средняя', 19000),
    (6, 'Сыромятникова Я. Л.', '20-2-1990', 'Преподаватель', False, 'Низкая', 14000),
    (7, 'Бусло П. С.', '31-12-1988', 'Преподаватель', True, 'Высокая', 29000),
    (8, 'Шарыпин И. В.', '22-6-1975', 'Преподаватель', False, 'Средняя', 21000),
    (9, 'Корбан К. З.', '29-3-1994', 'Преподаватель', False, 'Низкая', 10000),
    (10, 'Хачикян О. О.', '11-7-1998', 'Преподаватель', False, 'Средняя', 25000),
]