# Дан символ C. Вывести два символа, первый из которых предшествует символу C в
# кодовой таблице, а второй следует за символом C
try:
    C = ord(input('Введите один символ: '))
    print(f"Предыдущий символ: {chr(C-1)}, Следующий символ: {chr(C+1)}")
except TypeError:
    print('Неправильный ввод!')
